package com.ljw4dakeai.jichuban.Practice716.HouseWorkCode;

/**
 * @author ZJH
 */
public @interface Info {
    /**
     * <p>
     * 1，题目要求
     * 1. 产生10个 1-100 之间的随机数并存入数组中，随机数不能重复，随后遍历打印数组（元素都在一行打印）
     * 2. 反转数组中元素，再次遍历打印数组（元素都在一行打印）
     * 3. 找出数组中偶数元素并打印在控制台，要求每行打印两个元素
     * <p>
     * 运行结果（注意：必须按照如下格式进行打印）：
     * <p>
     * 产生的10个随机数为:
     * 79 52 47 1 42 16 87 18 82 2
     * 反转后的数组元素为:
     * 2 82 18 87 16 42 1 47 52 79
     * 数组中偶数元素有:
     * 2 82
     * 18 16
     * 42 52
     * <p>
     * <p>
     * <p>
     * <p>
     * 2，题目要求
     * 打印1~1000以内能同时被2和3整除的数，两个一行、三个一行打印。例如：
     * 6 12
     * 18 24 30
     * 36 42
     * 48 54 60
     * …
     * <p>
     * <p>
     * 3，题目要求
     * <p>
     * 1. 定义一个方法实现获取一个int数组：键盘录入数组的长度和随机数的范围（范围区间要大于数组长度），在数组中存储指定范围的随机数，并且随机数不能重复
     * 2. 定义一个方式实现查找索引：键盘录入一个数，在指定的数组中获取该数在数组中的索引，如果没有则返回-1。有，有几个索引返回几个索引
     */
}
