package com.ljw4dakeai.jinjieban.chapter12.test01inetaddress.testpackage01;

/**
 * @author ZJH
 * @info 常用的ip Dos 命令
 * ipconfig
 * 以太网适配器 VMware Network Adapter VMnet1:
 *
 *    连接特定的 DNS 后缀 . . . . . . . :
 *    本地链接 IPv6 地址. . . . . . . . : fe80::c1e8:31eb:d9b0:7131%10
 *    IPv4 地址 . . . . . . . . . . . . : 192.168.153.1
 *    子网掩码  . . . . . . . . . . . . : 255.255.255.0
 *    默认网关. . . . . . . . . . . . . :
 *
 * 以太网适配器 VMware Network Adapter VMnet8:
 *
 *    连接特定的 DNS 后缀 . . . . . . . :
 *    本地链接 IPv6 地址. . . . . . . . : fe80::8021:996f:66dc:d1d6%19
 *    IPv4 地址 . . . . . . . . . . . . : 192.168.95.1
 *    子网掩码  . . . . . . . . . . . . : 255.255.255.0
 *    默认网关. . . . . . . . . . . . . :
 *
 * 以太网适配器 以太网:
 *
 *    连接特定的 DNS 后缀 . . . . . . . :
 *    本地链接 IPv6 地址. . . . . . . . : fe80::44ed:b7e5:1010:23ea%9
 *    IPv4 地址 . . . . . . . . . . . . : 192.168.70.246
 *    子网掩码  . . . . . . . . . . . . : 255.255.255.0
 *    默认网关. . . . . . . . . . . . . : 192.168.70.1
 *
 * PPP 适配器 宽带连接:
 *
 *    连接特定的 DNS 后缀 . . . . . . . :
 *    IPv4 地址 . . . . . . . . . . . . : 10.254.10.90
 *    子网掩码  . . . . . . . . . . . . : 255.255.255.255
 *    默认网关. . . . . . . . . . . . . : 0.0.0.0
 *
 * 无线局域网适配器 WLAN:
 *
 *    媒体状态  . . . . . . . . . . . . : 媒体已断开连接
 *    连接特定的 DNS 后缀 . . . . . . . :
 * ping ip
 *
 *
 * 127.0.0.1 会送地址 表示本机地址, 一般用来测试
 */
public class Test03TestIpCmd {

}
